# Значение арифметического выражения 4^210 + 4^110 − x, 
# где x — целое положительное число, не превышающее 3000, записали в четверичной системе счисления. 
# Определите наименьшее значение x, при котором в четверичной записи числа, 
# являющегося значением данного арифметического выражения, содержится наибольшее количество нулей. 
# В ответе запишите число в десятичной системе счисления
m = []
for x in range(1, 3001):
    a = 4**210 + 4**110 - x
    k0 = 0
    while a > 0:
        if a % 4 == 0: k0 += 1
        a = a // 4
    m.append(k0)
print(max(m))
# ПАМЯТКА
# Меняется кажется только принт и цикл, в остальном всё идет по шаблону
# ЧИТАЙ УСЛОВИЕ ОБЯЗАТЕЛЬНО