# Условие задачи: Задание 14. ФИПИ 
# (Выражение с неизвестными цифрами) 
# Средняя. Операнды арифметического выражения записаны в системе счисления с основанием 29: 
# 463x7921_29 + 8241x153_29. В записи чисел переменной x обозначена неизвестная цифра из алфавита 
# 29-ричной системы счисления. Определите наименьшее значение x, 
# при котором значение данного арифметического выражения кратно 28. 
# Для найденного x вычислите частное от деления значения арифметического выражения на 28 и 
# укажите его в ответе в десятичной системе счисления. Основание системы счисления указывать не нужно.

for x in ('0123456789abcdefghi'):
    s = int("463"+x+"7921",29) + int("8241"+x+"153",29)
    if s%28==0:
        print(s//28)

# Или если не помнишь алфавит

from string import printable
for x in printable[:29]:
    x1 = int(f"923{x}874",29)
    x2 = int(f"524{x}6152",29)
    if (x1+x2)%28 ==0:
        print(x,(x1+x2)//28)

# Памятка
# from string import printable перебор букв латинского алфавита
# Этот код был успешно сворован



