# Для какого наибольшего целого неотрицательного числа A логическое выражение 
# (x+y≤27)∨(y≤x−1)∨(y≥A) 
# истинно при любых целых положительных x и y?
def f(x, y):
    return (x + y <= 27) or (y <= x - 1) or (y >= a)

for a in range(1000):
    if all(f(x, y) for x in range(1, 1000) for y in range(1, 1000)):
        print(a)

# На числовой прямой даны три отрезка: B = [32; 425], C = [130; 480] и D = [290; 575]. 
# Укажите наибольшую возможную длину такого отрезка А, для которого логическое выражение 
# ((x∈C)→¬(x∈D))∧(x∈A)∧¬(x∈B) истинно (т.е. принимает значение 1) при любом значении переменной х.

def f(x):
    B = 32<=x<=425
    C = 130<=x<=480
    D = 290<=x<=575
    A = a1<=x<=a2
    return (C<=(not D)) and A and not B

ox = [dx for x in [32,425,130,480,290,575] for dx in (x-0.01,x,x+0.01)]

m = []
for a1 in ox:
    for a2 in ox:
        if a2>a1 and all(f(x)==0 for x in ox):
            m.append(a2-a1)
print(max(m))

# На числовой прямой даны два отрезка: B = [290; 750] и C = [135; 675]. 
# Укажите наименьшую возможную длину такого отрезка A, что логическое выражение 
# (¬(x ∈ B) ∧ (x ∈ C)) → ((¬(x ∈ A) ∧ (x ∈ C)) → (x ∈ B)) истинно (т.е. принимает значение 1) при любом значении переменной x.

def f(x):
    B = 290<=x<=750
    C = 135<=x<=675
    A = a1<=x<=a2
    return (not B and C) <= ((not A and C)<=B)

ox = [dx for x in [290,750,135,675] for dx in (x-0.01,x,x+0.01)]

m = []
for a1 in ox:
    for a2 in ox:
        if a2>a1 and all(f(x)==1 for x in ox):
            m.append(a2-a1)
print(min(m))