# Исполнитель преобразует число на экране. У исполнителя есть три команды, которые обозначены латинскими буквами: 
# А. Прибавить 1; 
# В. Прибавить 2; 
# С. Умножить на 2. 
# Программа для исполнителя — это последовательность команд. 
# Сколько существует программ, для которых при исходном числе 3 результатом является число 20, при этом траектория вычислений содержит число 10? 
# Траектория вычислений программы — это последовательность результатов выполнения всех команд программы.

def f(x, y):
    if x > y or x == 10: # Для исключения из траектории
        return 0
    if x == y:
        return 1
    else:
        return f(x + 1, y) + f(x + 2, y) + f(x * 2, y) # Ходы
print(f(3, 7)*f(7,20))

# Исполнитель преобразует число на экране. У исполнителя есть две команды, которые обозначены латинскими буквами:
# A. Прибавь 1
# B. Поменяй местами
# Первая из этих команд увеличивает число на экране на 1. Вторая команда применяется только к числу, у которого цифра в разряде десятков по значению меньше цифры, стоящей в разряде единиц, и действует, заменяя число на экране числом, в котором цифры двух младших разрядов поменялись местами.
# Программа для исполнителя – это последовательность команд. Сколько существует программ, для которых при исходном числе 100 результатом является число 141?
# Траектория вычислений программы – это последовательность результатов выполнения всех команд программы.
# Например, для программы ABA при исходном числе 13 траектория состоит из чисел 14, 41, 42

def f(x,y):
    if x == y:
        return 1
    if x > y:
        return 0
    s = str(x)
    if s[1] < s[2]:
        return f(x+1,y)+f(int(s[0]+s[2]+s[1]),y)
    else:
        return f(x+1,y)
print(f(100,141))

# ПАМЯТКА
# Если хочешь добавить число в траекторию, то закинь их в скобки, как в 1 примере
# Если хочешь исключить, закинь в ретурн 0