# В терминологии сетей ТСР/IР маской сети называют двоичное число, которое показывает, какая часть IP-адреса узла сети относится к адресу сети, а какая - к адресу узла в этой сети. 
# Адрес сети получается результате применения поразрядной конъюнкции к заданному адресу узла и его маске. 
# Широковещательным адресом называется специализированный адрес, в котором на месте нулей в маске стоят единицы. 
# Адрес сети и широковещательный адрес не могут быть использованы для адресации сетевых устройств.
# Сеть задана IP-адресом одного из входящих в неё узлов 154.141.198.190 и сетевой маской 255.255.192.0.
# Найдите её широковещательный IP-адрес. В ответе укажите сумму числовых значений октетов найденного IP-адреса.
# Например, если бы найденный адрес был равен 100.20.3.4, то в ответе следовало бы записать: 127.

from ipaddress import *
net = ip_network('154.141.198.190/255.255.192.0', 0) 
print(net[-1])
print(154+141+255+255) # Тут цифры полученного с 1 принта


# В терминологии сетей ТСР/IP маской сети называют двоичное число, которое показывает, какая часть IP-адреса узла сети относится к адресу сети, а какая - к адресу узла в этой сети. 
# Адрес сети получается в результате применения поразрядной конъюнкции к заданному адресу узла и его маске.
# Широковещательным адресом называется специализированный адрес, в котором на месте нулей в маске стоят единицы. 
# Адрес сети и широковещательный адрес не могут быть использованы для адресации сетевых устройств.
# Сеть задана IP-адресом одного из входящих в неё узлов 146.180.173.153 и сетевой маской 255.192.0.0. Найдите наибольший в данной сети IP-адрес, который может быть назначен компьютеру. 
# В ответе укажите найденный IP-адрес без разделителей.
# Например, если бы найденный адрес был равен 111.22.3.44, то в ответе следовало бы записать: 11122344.

from ipaddress import *
net = ip_network('146.180.173.153/255.192.0.0', 0)
print(net[-2])
print(net[-2]) # Тут цифры полученного с 1 принта 

# В терминологии сетей TCP/IP маской сети называют двоичное число, которое показывает, какая часть IP-адреса узла сети относится к адресу сети, а какая - к адресу узла в этой сети. 
# Адрес сети получается в результате применения поразрядной конъюнкции к заданному адресу узла маске сети.
# Сеть задана IP-адресом 172.16.96.0 и маской сети 255.255.224.0.
# Сколько в этой сети IP-адресов, для которых количество единиц в их двоичной записи кратно 2?
# В ответе укажите только число.

from ipaddress import *
net = ip_network('172.16.96.0/255.255.224.0')
k = 0
for ip in net:
    b = f'{ip:b}' # b убирает незначащие нули
    if b.count('1')%2==0:
        k +=1
print(k)


# В терминологии сетей TCP/IP маской сети называют двоичное число, которое показывает, какая часть IP-адреса узла сети относится к адресу сети, а какая – к адресу узла в этой сети. 
# Адрес сети получается в результате применения поразрядной конъюнкции к заданному адресу узла и маске сети. 
# Широковещательным адресом называется специализированный адрес, в котором на месте нулей в маске стоят единицы. 
# Адрес сети и широковещательный адрес не могут быть использованы для адресации сетевых устройств. Сеть определена неизвестным адресом сети и содержит в себе узел с IP-адресом 192.214.116.184. 
# Известно, что в двоичной записи адреса этой сети содержится положительное и кратное 5 количество единиц. Сколько масок могут задавать такую сеть, если адрес сети не может состоять только из нулей? 
# В ответе укажите только число.

from ipaddress import ip_network
k = 0
for mask in range(33): # количество битов, их всего 32
    net = ip_network(f'192.214.116.184/{mask}', 0)
    if f'{int(net[0]):032b}'.count('1') % 5 == 0: # 032b добавляет незначащие нули, чтобы добить 32 бита
        k += 1
print(k)

# В терминологии сетей TCP/IP маской сети называют двоичное число, которое показывает, какая часть IP-адреса узла сети относится к адресу сети, а какая – к адресу узла в этой сети. 
# Адрес сети получается в результате применения поразрядной конъюнкции к заданному адресу узла и маске сети. Сеть задана IP-адресом одного из входящих в неё узлов 95.24.20.25 и маской сети 255.255.252.0. 
# Сколько ещё устройств можно подключить к этой сети, если известно, что к сети кроде данного узла подключено 3 ноутбука, 4 мобильных телефона, 2 планшета и smart-горшок с кактусом? 
# В ответе укажите только число.

from ipaddress import *
net = ip_network('95.24.20.25/255.255.252.0', 0)
print(net.num_addresses - 2 - 3 - 4 - 2 - 1 - 1) # вычитаешь данные устройва от количества адресов

# Памятка
# Их видимо ещё много, завершить