# Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежит куча камней. Игроки ходят по очереди, первый ход делает Петя. За один ход игрок может:
# - убрать из кучи 3 камня;
# - убрать из кучи 7 камней;
# - уменьшить количество камней в куче в 4 раза (количество камней, полученное при делении, округляется до меньшего).
# Например, из кучи в 20 камней за один ход можно получить кучу из 17, 13 или 5 камней.
# Игра завершается, когда количество камней в куче становится не более 15. Победителем считается игрок, сделавший последний ход, то есть первым получивший кучу из 15 или менее камней. 
# В начальный момент в куче было S камней, S > 15.
# Будем говорить, что игрок имеет выигрышную стратегию, если он может выиграть при любых ходах противника.
# Укажите минимальное значение S, при котором Петя не может выиграть за один ход, но при любом ходе Пети Ваня может выиграть своим первым ходом.

# Задание 20.
# Для игры, описанной в задании 19, найдите два наименьших значения S, при которых у Пети есть выигрышная стратегия, причём
# одновременно выполняются два условия:
# - Петя не может выиграть за один ход;
# - Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.
# Найденные значения запишите в ответе в порядке возрастания.

# Задание 21.
# Для игры, описанной в задании 19, найдите минимальное значение S, при котором одновременно выполняются два условия:
# - у Вани есть выигрышная стратегия, позволяющая ему выиграть первым или вторым ходом при любой игре Пети;
# - у Вани нет стратегии, которая позволит ему гарантированно выиграть первым ходом.

def f(s, m):
    if s <= 15 or m < 0: return m % 2 == 0
    h = [f(s - 3, m - 1), f(s - 7, m - 1), f(s // 4, m - 1)] # Описание ходов
    return any(h) if (m - 1) % 2 == 0 else all(h)  # Если НЕТ неудачного хода И НЕТ победы первым своим ходом, берем олл, ИНАЧЕ ани

print(19, [s for s in range(16, 1000) if f(s, 2)])
print(20, [s for s in range(16, 1000) if not f(s, 1) and f(s, 3)])
print(21, [s for s in range(16, 1000) if not f(s, 2) and f(s, 4)])



# Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежат две кучи камней. Игроки ходят по очереди, первый ход делает Петя. За один ход игрок может:
# – добавить в одну из куч (по своему выбору) 4 камня;
# – увеличить количество камней в одной из куч (по своему выбору) в 2 раза.
# Например, пусть в одной куче 20 камней, а в другой 30 камней; такую позицию в игре обозначим (20, 30). 
# Тогда за один ход можно получить любую из четырёх позиций: (24, 30), (20, 34), (40, 30), (20, 60). 
# Для того чтобы делать ходы, у каждого игрока есть неограниченное количество камней. 
# Игра завершается в тот момент, когда суммарное количество камней в двух кучах становится не менее 133. 
# Победителем считается игрок, сделавший последний ход, то есть первым получивший такую игровую позицию, при которой в двух кучах суммарно 133 камня или больше. 
# В начальный момент в первой куче было 17 камней, во второй куче – S камней; 1 ≤ S ≤ 115.
# Будем говорить, что игрок имеет выигрышную стратегию, если он может выиграть при любых ходах противника. 
# Известно, что Ваня выиграл своим первым ходом. Укажите минимальное значение S, при котором такая ситуация возможна.

# Задание 20.
# Для игры, описанной в задании 19, найдите два наименьших значения S, при которых у Пети есть выигрышная стратегия, причём одновременно выполняются два условия:
# – Петя не может выиграть за один ход;
# – Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.
# Найденные значения запишите в ответе в порядке возрастания.

# Задание 21.
# Для игры, описанной в задании 19, найдите наименьшее значение S, при котором одновременно выполняются два условия:
# – у Вани есть выигрышная стратегия, позволяющая ему выиграть первым или вторым ходом при любой игре Пети;
# – у Вани нет стратегии, которая позволит ему гарантированно выиграть первым ходом.
def f(a, b, m):
    if a + b >= 133: return m % 2 == 0
    if m == 0: return 0
    h = [f(a + 4, b, m - 1), f(a * 2, b, m - 1), f(a, b + 4, m - 1), f(a, b * 2, m - 1)] # Описание ходов
    return any(h) if (m - 1) % 2 == 0 else any(h)   # Если НЕТ неудачного хода И НЕТ победы первым своим ходом, берем олл, ИНАЧЕ ани

print([s for s in range(1, 116) if f(17, s, 2)]) 
print([s for s in range(1, 116) if f(17, s, 3) > f(17, s, 1)])
print([s for s in range(1, 116) if f(17, s, 4) > f(17, s, 2)])