# Значение выражения 2 * 2187^2020 + 729^2021 - 2 * 243^2022 + 81^2023 - 2 * 27^2024 - 6561 записали в системе счисления с основанием 27. 
# Определите, сколько цифр в этой 27-ричной записи имеют числовое значение, большее 9.
x = 2*2187**2020 + 729**2021 - 2*243**2022 + 81**2023 - 2*27**2024 - 6561

count = 0
while x > 0:
    ost = x % 27
    if ost > 9:
        count = count + 1
    x //= 27

print(count)

# Значение арифметического выражения 9 * 11^210 + 8 * 11^150 - x, 
# где x — целое положительное число, не превышающее 3000, записали в 11-ричной системе счисления. 
# Определите наибольшее значение x, при котором в 11-ричной записи числа, 
# являющегося значением данного арифметического выражения, содержится ровно 60 нулей.
# В ответе запишите число в десятичной системе счисления.
for x in range(3000,1,-1):
    s = 9*11**210 + 8*11**150 - x
    k = 0
    while s>0:
        if s%11==0:
            k+=1
        s//=11
    if k==60:
        print(x)

# Значение арифметического выражения 3 · 27^9 + 2 · 27^6 + 27^3 − x, 
# где x - целое положительное число, не превышающее 27 000, записали в 27-ричной системе счисления. 
# Определите наименьшее значение x, при котором в 27-ричной записи числа, 
# являющегося значением данного арифметического выражения, содержится ровно 6 нулей.
# В ответе запишите число в десятичной системе счисления.

for x in range(1, 27000):
    a = 3*27**9 + 2*27**6 + 27**3 - x
    k = 0
    while a > 0:
        if a % 27 == 0: 
            k += 1
        a = a // 27
    if k == 6:
        print(x)

#ПАМЯТКА
# второй тип 14 задачи виден по известным нулям и чертильным условиям задачи
# читай условие задачи, если наим, то цикл идет как надо, иначе наоборот
