# Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m»; 
# пусть на числовой прямой дан отрезок B = [70; 90].
# Для какого наибольшего натурального числа A логическое выражение
# ДЕЛ(x, A) ∨ ((x ∈ B) → ¬ДЕЛ(x, 22))
# истинно (т.е. принимает значение 1) при любом целом положительном значении переменной x?
def f(x):
    B = 70 <= x <= 90
    return (x % a == 0) or (B <= (x % 22 != 0))
for a in range(1, 100000):
    if all(f(x) == 1 for x in range(1, 10 ** 6)):
        print(a)


# Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m».
# Для какого наибольшего натурального числа A логическое выражение
# ДЕЛ(x, 33) → (¬ДЕЛ(x, A) → ¬ДЕЛ(x, 242))
# истинно (т.е. принимает значение 1) при любом целом положительном значении переменной x?

def f(x):
    return (x%33==0)<=((x%a!=0) <= (x%242!=0))
for a in range(1,10000):
    if all(f(x)==1 for x in range(1,10**6)):
        print(a)
# ПАМЯТКА
# Великая разница между ними лишь в том, что в 1 примере есть отрезок, а во втором нет. Вот и всё
