# Все 5-буквенные слова, составленные из букв АПРЕЛЬ, записаны в алфавитном порядке и пронумерованы, начиная с 1.
# Ниже приведено начало списка:
# 1. ААААА
# 2. ААААЕ
# 3. ААААЛ
# 4. ААААП
# 5. ААААР
# 6. ААААЬ
# Укажите номера слов в этом списке, которые стоят на четных местах, не начинаются с букв «Р» и «Ь», а буква «Л» встречается в них не менее двух раз. 
# В ответе запишите количество таких номеров (или сами номера, в зависимости от формулировки).

from itertools import *
n = 0
c = []
for x in product('аелпръ',repeat = 5):
    s = ''.join(x)
    n += 1
    if n%2==0 and s[0] not in 'ръ' and s.count('л') >= 2:
        c.append(n)

# Сколько существует 5-значных чисел в семеричной системе счисления, 
# в записи которых цифра «1» встречается не более двух раз, а цифра «0» встречается ровно один раз?

from itertools import *
n = 0
c = []
for x in product('0123456',repeat=5):
    s = ''.join(x)
    if s.count('1') <= 2 and s.count('0') == 1 and s[0] not in '0':
        n += 1
print(n)

# Артем составляет 5-буквенные слова перестановкой букв своего имени «АРТЁМ». 
# Каждая буква должна использоваться ровно один раз. 
# При этом не допускается, чтобы слово одновременно и начиналось, и заканчивалось на гласную букву (буквы А или Ё). 
# Сколько различных слов может составить Артем?
from itertools import *
n = 0
c = []
b = 'AÉ'
for x in permutations('APTÉM', r = 5):
    if not (x[0] in b and x[-1] in b):
        n+=1
print(n)

# ПАМЯТКА
# всего 3 вида, на номер, на количество и на уникальные слова